#### ColumnAttachmentCutStyle Enumeration

---

|  |
| --- |
| See Also |

Control the handling of columns that intersect their targets.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum ColumnAttachmentCutStyle ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ColumnAttachmentCutStyle ``` |

| Visual C++ |
| --- |
| ``` public enum class ColumnAttachmentCutStyle ``` |

# Members

| Member name | Description |
| --- | --- |
| CutColumn |  |
| CutTarget |  |
| None |  |

# See Also

Autodesk.Revit.DB Namespace